---
kind: property
id: P:Autodesk.Revit.DB.Events.LinkedResourceOpeningEventArgs.ResourceType
source: html/a765b228-3376-e386-59e1-ca559329f6cc.htm
---
# Autodesk.Revit.DB.Events.LinkedResourceOpeningEventArgs.ResourceType Property

The desired linked resource type.

## Syntax (C#)
```csharp
public ExternalResourceType ResourceType { get; }
```